Revit 2027 API
ParameterTypeId.JoistSystemNewBeamTypeParam Property
 "Beam Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId JoistSystemNewBeamTypeParam { get; }
Public Shared ReadOnly Property JoistSystemNewBeamTypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ JoistSystemNewBeamTypeParam {
	ForgeTypeId^ get ();
}
static member JoistSystemNewBeamTypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace